In [7]:
import numpy as np
import pandas as pd

## Concatenation / Appends

The `pd.concat()` fucntion and `DataFrame.append()` method takes DataFrames with identical columns and makes a DataFrame that is **taller** than either of them by stacking them on top of each other.

For example, it can turn this `df1` DataFrame:

| Day | Weather |
| :-: | :---:   |
| Monday | Sunny   |
| Tuesday | Rainy |

and this `df2` DataFrame:

| Day | Weather |
| :-: | :---:   |
| Wednesday | Sunny   |
| Thursday | Rainy |

into this:

| Day | Weather |
| :-: | :---:   |
| Monday | Sunny   |
| Tuesday | Rainy |
| Wednesday | Sunny   |
| Thursday | Rainy |


with one line of code:

```python
pd.concat([df1, df2])
```

**Note:** If you'd like pandas to ignore the index of the dataframes when appending them, the following option is helpful:

```python
pd.concat([df1, df2], ignore_index=True)
```

**Note:** With the `pd.concat()` function, you can concatenate as many dataframes in one step as you want!

#### Exercise

Let's practice concatenating DataFrames with the `pd.concat` function:

In [23]:
df1 = pd.DataFrame({'Name': ['Jackson', 'Josh', 'Jenny'], 'Age': [16, 19, 17]})
df1

      Name  Age
0  Jackson   16
1     Josh   19
2    Jenny   17

In [28]:
df2 = pd.DataFrame({'Name': ['Jess', 'Jon', 'Joe'], 'Age': [21, 16, 23]}, index=[3, 4, 5])
df2

   Name  Age
3  Jess   21
4   Jon   16
5   Joe   23

In [36]:
df3 = pd.DataFrame({'Name': ['Jill', 'Josephine', 'Jack'], 'Age': [5, 10, 61]})
df3

        Name  Age
0       Jill    5
1  Josephine   10
2       Jack   61

Concatenate df1 and df2 together!

Concatenate df2 and df3 together!

Concatenate all three dataframes

## Merge / Joins
The `pd.merge()` function and `DataFrame.join()` method take two DataFrames and make them **wider** by matching rows with the same-values on a specified column.  

For example, it can turn this `df1` DataFrame:

| Day | Weather |
| :-: | :---:   |
| Monday | Sunny   |
| Tuesday | Rainy |

and this `df2` DataFrame:

| Day | Temperature |
| :-: | :---:   |
| Tuesday | 12   |
| Monday | 18 |

into this:

| Day | Weather | Temperature |
| :-: | :---:   | :---: |
| Monday | Sunny   | 18 |
| Tuesday | Rainy | 12 |

with one line of code:

```python
df_merged = pd.merge(left=df1, right=df2, left_on="Day", right_on="Day")
```

Just specify which columns should be matched up with each other, and it will search for the matching values automatically!  If you want it to use the index, you can alternatively supply the option `left_index=True` and/or `right_index=True`.

### Exercises

Let's practice merging dataframes with the `pd.merge()` function.

Dataframe 1:

In [12]:
df1 = pd.DataFrame({'Name': ['Paul', 'Arash', 'Jenny'], 'Age': [16, 19, 17]})
df1

    Name  Age
0   Paul   16
1  Arash   19
2  Jenny   17

Dataframe 2:

In [13]:
df2 = pd.DataFrame({'Name': ['Arash', 'Paul', 'Sara'], 'Weight': [32, 15, 37]})
df2

    Name  Weight
0  Arash      32
1   Paul      15
2   Sara      37

Dataframe 3:

In [19]:
df3 = pd.DataFrame({'Name': ['Amy', 'Paul', 'Sara'], 'Height': [170, 190, 143]})
df3

   Name  Height
0   Amy     170
1  Paul     190
2  Sara     143

Merge them together.  Who do we know both the name and weight of?

Who do we know both the weight and height of?

Try merging all 3 by merging twice.  Who do we know everything about?

Note that the Names that weren't present in both dataframes dropped out of the final result.  If you'd like to keep them and have NaNs appear, you can change the `how` parameter in the `pd.merge()` function.  Let's try out a few options by merging dataframes 1 and 2:

`how="outer"`

`how="left"`

`how="right"`

`how="inner"`

## Melts

The `pd.melt()` function and `DataFrame.melt()` method take a single dataframe and make it **taller** by taking data stored in column names and putting it into the rows along with the rest of the data, adding extra metadata in the process.

For example, it can turn this `df` DataFrame:

| Month | Year | Monday | Tuesday | Wednesday |
| :--:  | :--: | :--:   | :--:    | :--:      |
| January | 2021 | 0 | -2 | -1 |
| February | 2021 | 2 | 4 | -2 |

into this:

| Month | Year | Weekday | Temperature |
| :--:  | :--: | :--:    |  :--:       |
| January | 2021 | Monday | 0 |
| January | 2021 | Tuesday | -2 |
| January | 2021 | Wednesday | -1 |
| February | 2021 | Monday | 2 |
| February | 2021 | Tuesday | 4 | 
| February | 2021 | Wednesday | -2 |

with one line of code:

```python
pd.melt(
    df, 
    id_vars=['Month', 'Year'],  # The columns that should stay the same
    value_vars=['Monday', 'Tuesday', 'Wednesday'],   # The columns that should melt
    var_name='Weekday',  # The new Column that will represent the melted column name's variable
    value_name='Temperature'  # The new Column that the data represents
)
```

**Note**: Melting a dataframe also called *"tidying"* data, making a *"long"* dataframe from a *"wide"* dataframe, or building a *design matrix*

#### Exercises

Let's practice tidying dataframes with the `pd.melt()` function

In [32]:
df = pd.DataFrame({
    'Gene': ["CAPZB", "PRDX6"],
    'Intensity_1': [200, 220],
    'Intensity_2': [250, 160],
    'Abundance_1': [5.2, 2.8],
    'Abundance_2': [5.2, 4.6],
})
df

    Gene  Intensity_1  Intensity_2  Abundance_1  Abundance_2
0  CAPZB          200          250          5.2          5.2
1  PRDX6          220          160          2.8          4.6

Melt the "Intensity_X" columns into two new columns: "Intensity" and "SessionNum"

Melt the "Abundance_X" columns into two new columns: "Abundance" and "SessionNum"

Merge the two melted dataframes you just made on the "SessionNum" column

Melt the merged dataframe's "Intensity" and "Abundance" columns into two new columns: "Metric" and "Value"

## Splitting Strings into Multiple Columns

Splitting a string around a seperator can done with the `pd.Sereis.str.split()` function.  With it, you can turn a DataFrame from this:

| line |
| :--: |
| hi_1 |
| bye_2|

into this:

| line | greeting | num |
| :--: | :--: | :--: |
| hi_1 | hi | 1 |
| bye_2| bye | 2 |

using a single line:

```python
df[['greeting', 'num']] = df['line'].str.split('_', expand=True)
```

Let's try it out!

In [49]:
df = pd.DataFrame({
    'counts': ["1;3;5", "10;2;6"],
    'intensities': ['5_32_654', "10_1_99"],
})
df

   counts intensities
0   1;3;5    5_32_654
1  10;2;6     10_1_99

Split the Counts into Counts1, Counts2, and Counts3

Split the Intensities into Intensities1, Intensities2, and Instensities3

Melt them into a single dataframe with Trial, Metric, and Values columns!

## Extra: Concatenating Across CSV Files Using Dask.DataFrame.read_csv()

Let's say all these dataframes were stored as CSV files on our computer...

In [42]:
df1 = pd.DataFrame({'Name': ['Jackson', 'Josh', 'Jenny'], 'Age': [16, 19, 17]})
df1.to_csv("names_1.csv", index=False)

In [43]:
df2 = pd.DataFrame({'Name': ['Jess', 'Jon', 'Joe'], 'Age': [21, 16, 23]}, index=[3, 4, 5])
df2.to_csv("names_2.csv", index=False)

In [44]:
df3 = pd.DataFrame({'Name': ['Jill', 'Josephine', 'Jack'], 'Age': [5, 10, 61]})
df3.to_csv("names_3.csv", index=False)

Let's just read them all at once!

In [33]:
import dask.dataframe as dd

In [47]:
dd.read_csv("names_*.csv").compute()

        Name  Age
0    Jackson   16
1       Josh   19
2      Jenny   17
0       Jess   21
1        Jon   16
2        Joe   23
0       Jill    5
1  Josephine   10
2       Jack   61